## **Setting up SQL Environment in Jupyter Notebook**

This notebook demonstrates how to:
- Install and load SQL tooling in Jupyter
- Connect to a SQLite database file using `ipython-sql`

---

### 1. Download the Chinook SQLite database file
[Click here](https://www.sqlitetutorial.net/sqlite-sample-database/) to download the sample chinook.db file from the SQLite official site or visit my [GitHub Repo](https://github.com/ObengKojo23/sql-in-jupyter-notebook) to the download.

---

### 2. Install required Python modules (one-off)
You need to install 3 python modules.
Note that these are installed **locally** and typically only once.  


### What each module is for

- **SQLAlchemy** — Python’s universal database toolkit. It handles database connections (“engines”) for many backends.  
  
- **ipython-sql** — An IPython/Jupyter extension adding `%sql`/`%%sql` magics so you can run SQL right inside notebook cells and display results as pretty tables or DataFrames.

- **PyMySQL (optional)** — A pure-Python MySQL/MariaDB driver. Usually for connecting to MySQL.  
  For **SQLite**, you may **not** need a separate driver since Python ships with `sqlite3`.

---

 Remember to use `%pip` instead of plain `pip` in notebooks when installing the modules?

- `%pip` installs into the **active kernel’s** environment, avoiding “installed but not found” issues.
- If `%pip` isn’t available, `!pip install ...` also works (shell command), but `%pip` is safer in notebooks.

Installing the Modules

In [ ]:
%pip install sqlalchemy

In [ ]:
%pip install ipython-sql

In [ ]:
%pip install pymysql

### 3. Load the SQL extension and connect to SQLite

- #### Load the SQL magic command/extension
    Run this once per notebook session.
    This enables you to run SQL queries directly in your notebook using the `%sql` and `%%sql` magic commands.

In [5]:
# Load the ipython-sql extension to enable %sql/%%sql magic commands in this notebook
%load_ext sql

- #### Connect to the database in the current folder:

In [6]:
# Connect to the SQLite database file named chinook.db in the current folder
%sql sqlite:///chinook.db

- #### Running `SQL` queries

    With the sample database loaded, we can interact with it by using the `%%sql` cell magic in any cell where we want to run SQL queries.

Let’s run a few queries against the Chinook database.

1. This query lists all user-created tables and views from `sqlite_master`, excluding internal `sqlite_%` objects, and orders the results alphabetically by `name`

In [7]:
%%sql

-- List all user-defined tables (excluding SQLite system tables)
SELECT name
FROM sqlite_master
WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%'
ORDER BY name;

 * sqlite:///chinook.db
Done.

[('albums',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoice_items',),
 ('invoices',),
 ('media_types',),
 ('playlist_track',),
 ('playlists',),
 ('tracks',)]

2. This command returns the column schema (name, type, nullability, default, primary-key flag) for a table.

In [8]:
%%sql
-- Getting the schema of the 'albums' table to understand its structure
PRAGMA table_info('albums');

 * sqlite:///chinook.db
Done.

[(0, 'AlbumId', 'INTEGER', 1, None, 1),
 (1, 'Title', 'NVARCHAR(160)', 1, None, 0),
 (2, 'ArtistId', 'INTEGER', 1, None, 0)]

3. This returns the first 10 rows from the albums table, displaying all columns.

In [9]:
%%sql
-- List all columns in the 'Album' table
SELECT *
FROM albums
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3),
 (6, 'Jagged Little Pill', 4),
 (7, 'Facelift', 5),
 (8, 'Warner 25 Anos', 6),
 (9, 'Plays Metallica By Four Cellos', 7),
 (10, 'Audioslave', 8)]